In [9]:
#series
##series的创建

In [10]:
pd.Series(np.arange(9))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
dtype: int64

In [11]:
pd.Series([1.2,2.3,4.5,5.0],index=['a','b','c','d'])

a    1.2
b    2.3
c    4.5
d    5.0
dtype: float64

In [12]:
color_count=pd.Series({"red":10,"green":20,"blue":30})

In [13]:
color_count

red      10
green    20
blue     30
dtype: int64

1.2series的属性

In [14]:
color_count.index

Index(['red', 'green', 'blue'], dtype='object')

In [15]:
color_count.values

array([10, 20, 30])

In [16]:
color_count[2]

C:\Users\22793\AppData\Local\Temp\ipykernel_14192\1319523636.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  color_count[2]

np.int64(30)

2DataFrame

2.1DataFrame创建

In [17]:
pd.DataFrame(np.random.randn(2,3))

          0         1         2
0 -0.022991  3.747096 -0.849116
1  0.399267 -0.169382 -0.737816

In [18]:
score = np.random.randint(40,100,(10,5))
score

array([[87, 42, 60, 90, 40],
       [97, 91, 40, 52, 59],
       [89, 71, 83, 62, 88],
       [82, 98, 76, 61, 82],
       [99, 80, 78, 83, 40],
       [50, 97, 60, 89, 89],
       [66, 85, 41, 88, 59],
       [99, 87, 96, 48, 86],
       [65, 84, 50, 41, 85],
       [57, 64, 43, 51, 63]], dtype=int32)

In [19]:
score_define=pd.DataFrame(score)
score_define

    0   1   2   3   4
0  87  42  60  90  40
1  97  91  40  52  59
2  89  71  83  62  88
3  82  98  76  61  82
4  99  80  78  83  40
5  50  97  60  89  89
6  66  85  41  88  59
7  99  87  96  48  86
8  65  84  50  41  85
9  57  64  43  51  63

In [20]:
subject = ["语文","数学","英语","政治","体育"]
stu=['同学'+str(i+1) for i in range(score_define.shape[0])]
data=pd.DataFrame(score,columns=subject,index=stu)

In [21]:
data

      语文  数学  英语  政治  体育
同学1   87  42  60  90  40
同学2   97  91  40  52  59
同学3   89  71  83  62  88
同学4   82  98  76  61  82
同学5   99  80  78  83  40
同学6   50  97  60  89  89
同学7   66  85  41  88  59
同学8   99  87  96  48  86
同学9   65  84  50  41  85
同学10  57  64  43  51  63

In [22]:
#data.T

In [23]:
data.head(6)

     语文  数学  英语  政治  体育
同学1  87  42  60  90  40
同学2  97  91  40  52  59
同学3  89  71  83  62  88
同学4  82  98  76  61  82
同学5  99  80  78  83  40
同学6  50  97  60  89  89

In [24]:
data.tail(5)

      语文  数学  英语  政治  体育
同学6   50  97  60  89  89
同学7   66  85  41  88  59
同学8   99  87  96  48  86
同学9   65  84  50  41  85
同学10  57  64  43  51  63

修改行列索引值，只能必须全部修改

In [25]:
# data.reset_index(drop=True/False)
# drop默认为False,不删除原来的索引，如果为True，删除原来的索引

In [26]:
df = pd.DataFrame({'mouth':[1,4,7,10],
                   'year':[2012,2014,2016,2018],
                   'sale':[44,46,23,67]})
df

   mouth  year  sale
0      1  2012    44
1      4  2014    46
2      7  2016    23
3     10  2018    67

In [27]:
df.set_index('year')

      mouth  sale
year
2012      1    44
2014      4    46
2016      7    23
2018     10    67

In [28]:
df=df.set_index(['year','mouth'])
df

            sale
year mouth
2012 1        44
2014 4        46
2016 7        23
2018 10       67

In [29]:
df

            sale
year mouth
2012 1        44
2014 4        46
2016 7        23
2018 10       67

In [30]:
df.index

MultiIndex([(2012,  1),
            (2014,  4),
            (2016,  7),
            (2018, 10)],
           names=['year', 'mouth'])